In [1]:
import pandas as pd

purchase_data_file = "purchase_data.csv"
purchase_data = pd.read_csv(purchase_data_file)

In [2]:
#Create a dataframe (purchase_data_df)
purchase_data_df = pd.DataFrame(purchase_data)
purchase_data_df.head(10)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
5,5,Yalae81,22,Male,81,Dreamkiss,3.61
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18
7,7,Iskjaskst81,20,Male,162,Abyssal Shard,2.67
8,8,Undjask33,22,Male,21,Souleater,1.10
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58

In [3]:
##'Player Count' data frame
#Total number of players - Players made more than one purchase = duplicates values 
total_players = len(purchase_data_df['SN'].unique())
total_players_df = pd.DataFrame ([{'Total Players':total_players}])
total_players_df

   Total Players
0            576

In [4]:
#Total number of unique items - Items purchased more than one time = duplicate values
total_items = len(purchase_data_df['Item Name'].unique())

In [5]:
#Total number of purchases = row length of dataframe
total_purchases = len(purchase_data_df)

In [6]:
#Total revenue = Sum of 'Price' column 
total_revenue = purchase_data_df['Price'].sum()

In [7]:
#Average price paid = mean of 'Price' column
average_price = purchase_data_df['Price'].mean()

In [8]:
##'Purchasing Analysis (Total) data frame'
purchasing_analysis_total_df = pd.DataFrame([{
    'Number of Unique Items':total_items,
'Average Price':average_price,
'Number of Purchases':total_purchases,
'Total Revenue':total_revenue}])

#format 'Average Price' and 'Total Revenue' values to currency
purchasing_analysis_total_df['Average Price'] = purchasing_analysis_total_df['Average Price'].map("${0:,.2f}".format)
purchasing_analysis_total_df['Total Revenue'] = purchasing_analysis_total_df['Total Revenue'].map("${0:,.2f}".format)
purchasing_analysis_total_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [9]:
#Unique values in 'Gender' column
unique_gender_values = purchase_data_df['Gender'].unique()
unique_gender_values

array(['Male', 'Other / Non-Disclosed', 'Female'], dtype=object)

In [10]:
##'Gender Demogrpahics' data frame
#Create a data frame ('gender_df') from 'SN' (players) column and 'Gender' column
gender_df = purchase_data_df[['SN','Gender']]
gender_df['Gender'].astype('string')

#Removed duplicate values from dataframe 'gender_df'
gender_df = gender_df.drop_duplicates()

#Rename value 'Other / Non-Disclosed' to 'Other'
gender_df = gender_df.replace({"Other / Non-Disclosed": "Other"})
print(gender_df)

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
773         Hala31    Male
774     Jiskjask80    Male
775     Aethedru70  Female
777     Yathecal72    Male
778        Sisur91    Male

[576 rows x 2 columns]

In [11]:
#Create a data frame of just 'Male' values by filtering out 'gender_df' by 'Male' 
columns = ['SN', 'Gender']
male_df = gender_df.loc[gender_df['Gender'] == "Male", columns]

#total number of male players by counting length of 'Male' dataframe 
total_male = len(male_df)

In [12]:
#Create a data frame of just 'Female' values by filtering out 'gender_df' by 'Female' 
columns = ['SN', 'Gender']
female_df = gender_df.loc[gender_df['Gender'] == "Female", columns]

#total number of male players by counting length of 'Female' dataframe 
total_female = len(female_df)

In [13]:
#Create a data frame of just 'Other' values by filtering out 'gender_df' by 'Other' 
columns = ['SN', 'Gender']
other_df = gender_df.loc[gender_df['Gender'] == "Other", columns]

#total number of male players by counting length of 'Other' dataframe 
total_other = len(other_df)

In [14]:
#Percentages of player demographics
percent_male = total_male / total_players
percent_female = total_female / total_players
percent_other = total_other / total_players

In [15]:
#create 'Gender Demographics' data frame
gender_dem_df = pd.DataFrame({'Gender':['Male','Female','Other/Non-Disclosed'],
                              'Total Count':[total_male, total_female, total_other],
                             'Percentage of Players':[percent_male, percent_female, percent_other]})
gender_dem_df['Percentage of Players'] = gender_dem_df['Percentage of Players'].map("{:.2%}".format)
gender_dem_df = gender_dem_df.set_index(['Gender'])
gender_dem_df

                     Total Count Percentage of Players
Gender
Male                         484                84.03%
Female                        81                14.06%
Other/Non-Disclosed           11                 1.91%

In [16]:
##'Purhcase Analysis (Gender)'
#Create a data frame using 'purchase_data_df', set index to 'Gender', & only keep 'Price' values
purchase_analysis_gender_df = purchase_data_df.set_index('Gender')
price_analysis_gender_df = purchase_analysis_gender_df[['Price']]
price_analysis_gender_df

        Price
Gender
Male     3.53
Male     1.56
Male     4.88
Male     3.27
Male     1.44
...       ...
Female   3.54
Male     1.63
Male     3.46
Male     4.19
Male     4.60

[780 rows x 1 columns]

In [17]:
#create a 'Total Purchase Value' data frame
purchase_analysis_gender_group = price_analysis_gender_df.groupby(['Gender'])
purchase_analysis_gender_tpv_df = purchase_analysis_gender_group.sum()

#rename 'Price' column to 'Total Purchase Value'
purchase_analysis_gender_tpv_df=purchase_analysis_gender_tpv_df.rename(columns={"Price":"Total Purchase Value"})
purchase_analysis_gender_tpv_df=purchase_analysis_gender_tpv_df['Total Purchase Value'].map("${0:,.2f}".format)
purchase_analysis_gender_tpv_df

Gender
Female                     $361.94
Male                     $1,967.64
Other / Non-Disclosed       $50.19
Name: Total Purchase Value, dtype: object

In [18]:
#create an 'Average Purhcase Price' data frame
purchase_analysis_gender_avg_df = purchase_analysis_gender_group.mean()

#rename 'Price' column to 'Average Purchase Price'
purchase_analysis_gender_avg_df=purchase_analysis_gender_avg_df.rename(columns={"Price":"Average Purchase Price"})
purchase_analysis_gender_avg_df=purchase_analysis_gender_avg_df['Average Purchase Price'].map("${:.2f}".format)
purchase_analysis_gender_avg_df

Gender
Female                   $3.20
Male                     $3.02
Other / Non-Disclosed    $3.35
Name: Average Purchase Price, dtype: object

In [19]:
#create a 'Total Count of Purchases' data frame
purchase_analysis_gender_tcp_df = purchase_analysis_gender_group.count()

#rename 'Price' column to 'Total Count of Purchases'
purchase_analysis_gender_tcp_df=purchase_analysis_gender_tcp_df.rename(columns={"Price":"Total Count of Purchases"})
purchase_analysis_gender_tcp_df

                       Total Count of Purchases
Gender
Female                                      113
Male                                        652
Other / Non-Disclosed                        15

In [20]:
## *skipped* create a 'Average Total Purchase Per Person' data frame
#individual_purchase_gender_df = purchase_analysis_gender_df[['SN','Price']]
#individual_purchase_gender_df

In [21]:
#add data frames 'Total Purchase Value', 'Average Purchase Price', 'Total Count of Purchases', & 'Average Total Purchase per Person' to 'Purchase Analysis (Gender)' data frame - i.e. ('purchase_analysis_gender_df')
#original 'purchase_analysis_gender_df' data frame will be replaced
purchase_analysis_gender_tcp_df['Average Purchase Price'] = purchase_analysis_gender_avg_df
purchase_analysis_gender_tcp_df['Total Purchase Value'] = purchase_analysis_gender_tpv_df
purchase_analysis_gender_df = purchase_analysis_gender_tcp_df
purchase_analysis_gender_df

,Total Count of Purchases,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,$3.20,$361.94
Male,652,$3.02,"$1,967.64"
Other / Non-Disclosed,15,$3.35,$50.19

In [22]:
##'Age Demographics'
#creat a data frame from 'purchase_data_df' of just 'Age' values
purchase_age_raw_df = purchase_data_df[['SN','Age']]
purchase_age_raw_df = purchase_age_raw_df.drop_duplicates()
del purchase_age_raw_df['SN']

#created bins and group names
bins = [0, 9, 14, 19, 24 , 29, 34, 39, 60]
group_names = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

#cut 'purchase_age_raw_df & create data frame 'purchase_age_df'
purchase_age_raw_df['Player Ages'] = pd.cut(purchase_age_raw_df['Age'], bins, labels=group_names, include_lowest=True)
purchase_age_dem_df = purchase_age_raw_df.groupby('Player Ages')
purchase_age_dem_df = purchase_age_dem_df.count()

#create 'Percentage of Players' column and format values to percentage
purchase_age_dem_df['Percentage of Players'] = (purchase_age_dem_df['Age']/total_players).map("{:.2%}".format)

#rename 'Age' column to 'Total Count'
purchase_age_dem_df = purchase_age_dem_df.rename(columns={"Age":"Total Count"})
purchase_age_dem_df

             Total Count Percentage of Players
Player Ages
<10                   17                 2.95%
10-14                 22                 3.82%
15-19                107                18.58%
20-24                258                44.79%
25-29                 77                13.37%
30-34                 52                 9.03%
35-39                 31                 5.38%
40+                   12                 2.08%

In [23]:
##'Purchase Analysis (Age)'
purchase_data_df['Player Ages'] = pd.cut(purchase_data_df['Age'], bins, labels=group_names, include_lowest=True)
purchase_analysis_age_raw_df = purchase_data_df[['Player Ages','Price']]
purchase_analysis_age_raw_df = purchase_analysis_age_raw_df.set_index('Player Ages')
purchase_analysis_age_raw_df

             Price
Player Ages
20-24         3.53
40+           1.56
20-24         4.88
20-24         3.27
20-24         1.44
...            ...
20-24         3.54
20-24         1.63
20-24         3.46
<10           4.19
20-24         4.60

[780 rows x 1 columns]

In [24]:
#create data frame 'Total Purchase Count' = groupby 'Player Ages' and sum column 'Price'
purchase_analysis_age_df = purchase_analysis_age_raw_df.groupby(['Player Ages'])
purchase_analysis_age_tpc_df = pd.DataFrame(purchase_analysis_age_df.count())

#rename 'Price' column to 'Total Purchase Count'
purchase_analysis_age_tpc_df = purchase_analysis_age_tpc_df.rename(columns={"Price":"Total Purchase Count"})
purchase_analysis_age_tpc_df

             Total Purchase Count
Player Ages
<10                            23
10-14                          28
15-19                         136
20-24                         365
25-29                         101
30-34                          73
35-39                          41
40+                            13

In [25]:
#create data frame 'Average Purchase Price' = groupby 'Player Ages' and sum column 'Price'
purchase_analysis_age_avg_df = purchase_analysis_age_df.mean('Price')
purchase_analysis_age_avg_df = purchase_analysis_age_avg_df['Price'].map("${0:,.2f}".format)
purchase_analysis_age_avg_df

Player Ages
<10      $3.35
10-14    $2.96
15-19    $3.04
20-24    $3.05
25-29    $2.90
30-34    $2.93
35-39    $3.60
40+      $2.94
Name: Price, dtype: object

In [26]:
#create data frame 'Total Purchase Value' = groupby 'Player Ages' and sum column 'Price'
purchase_analysis_age_tpv_df = purchase_analysis_age_df.sum('Price')
purchase_analysis_age_tpv_df = purchase_analysis_age_tpv_df['Price'].map("${0:,.2f}".format)
purchase_analysis_age_tpv_df

Player Ages
<10         $77.13
10-14       $82.78
15-19      $412.89
20-24    $1,114.06
25-29      $293.00
30-34      $214.00
35-39      $147.67
40+         $38.24
Name: Price, dtype: object

In [27]:
##*skipped create data frame "Average Purchase Price"

In [28]:
#add 'Average Purchase Price' and 'Total Purchase Value' data frame to 'Total Purchase Count' to create 'Purchase Analysis (Age) data frame - i.e. purchase_analysis_age_df'
purchase_analysis_age_tpc_df['Average Purchase Price'] = purchase_analysis_age_avg_df
purchase_analysis_age_tpc_df['Total Purchase Value'] = purchase_analysis_age_tpv_df
purchase_analysis_age_df = purchase_analysis_age_tpc_df
purchase_analysis_age_df

             Total Purchase Count Average Purchase Price Total Purchase Value
Player Ages
<10                            23                  $3.35               $77.13
10-14                          28                  $2.96               $82.78
15-19                         136                  $3.04              $412.89
20-24                         365                  $3.05            $1,114.06
25-29                         101                  $2.90              $293.00
30-34                          73                  $2.93              $214.00
35-39                          41                  $3.60              $147.67
40+                            13                  $2.94               $38.24

In [30]:
##'Top Spenders' 
#create a data frame of 'SN' (players) column & ' Price' column from original purchse data ('purchase_data_df')
spenders_analysis_raw_df = pd.DataFrame(purchase_data_df[['SN', 'Price']])

#spenders groupby data frame from 'spenders_analysis_raw_df'
spenders_analysis_group = spenders_analysis_raw_df.groupby(['SN'])

spenders_analysis_raw_df.head(10)

              SN  Price
0        Lisim78   3.53
1    Lisovynya38   1.56
2     Ithergue48   4.88
3  Chamassasya86   3.27
4      Iskosia90   1.44
5        Yalae81   3.61
6      Itheria73   2.18
7    Iskjaskst81   2.67
8      Undjask33   1.10
9    Chanosian48   3.58

In [60]:
#'Average Purchase Price' data frame for 'Top Spenders' data
spenders_analysis_group = spenders_analysis_raw_df.groupby(['SN'])
spenders_analysis_avg_df = spenders_analysis_group.mean()

#format values to currency & rename 'Price' column to 'Average Purhcase Price'
spenders_analysis_avg_df['Price'] = spenders_analysis_avg_df['Price'].map("${0:,.2f}".format)
spenders_analysis_avg_df = spenders_analysis_avg_df.rename(columns={"Price":"Average Purchase Price"})

spenders_analysis_avg_df

              Average Purchase Price
SN
Adairialis76                   $2.28
Adastirin33                    $4.48
Aeda94                         $4.91
Aela59                         $4.32
Aelaria33                      $1.79
...                              ...
Yathecal82                     $2.07
Yathedeu43                     $3.01
Yoishirrala98                  $4.58
Zhisrisu83                     $3.94
Zontibe81                      $2.68

[576 rows x 1 columns]

In [61]:
#'Total Purchase Value' data frame from 'Top Spenders' data
spenders_analysis_tpv_df = spenders_analysis_group.sum()

#format values to currency & rename 'Price' column to 'Total Purchase Value'
spenders_analysis_tpv_df['Price'] = spenders_analysis_tpv_df['Price'].map("${0:,.2f}".format)
spenders_analysis_tpv_df = spenders_analysis_tpv_df.rename(columns={"Price":"Total Purchase Value"})

spenders_analysis_tpv_df

              Total Purchase Value
SN
Adairialis76                 $2.28
Adastirin33                  $4.48
Aeda94                       $4.91
Aela59                       $4.32
Aelaria33                    $1.79
...                            ...
Yathecal82                   $6.22
Yathedeu43                   $6.02
Yoishirrala98                $4.58
Zhisrisu83                   $7.89
Zontibe81                    $8.03

[576 rows x 1 columns]

In [64]:
#'Purchase Count' data frame from 'Top Spenders' data
spenders_analysis_total_df = spenders_analysis_group.count()

#rename 'Price' column to 'Purchase Count'
spenders_analysis_total_df = spenders_analysis_total_df.rename(columns={"Price":"Purchase Count"})
spenders_analysis_total_df

               Purchase Count
SN
Adairialis76                1
Adastirin33                 1
Aeda94                      1
Aela59                      1
Aelaria33                   1
...                       ...
Yathecal82                  3
Yathedeu43                  2
Yoishirrala98               1
Zhisrisu83                  2
Zontibe81                   3

[576 rows x 1 columns]